# -*- coding: utf-8 -*-
# @Time    : 2022/3/14 9:13
# @Author  : jinjie

"""
北凡 = {
    "语文": 70,
    "数学": 65,
    "英语": 66,
    "生物": 69,
    "政治": 78,
    "跳远": [1.2, 1.3, 1.2]
}

百里的语文成绩比北凡高20，跳远最后一次是1.5.其他成绩和北凡一样
星瑶的语文成绩比北凡高10，.其他成绩和北凡一样
请用最少的代码，打印出百里和星瑶的各项成绩

"""


北凡 = {
    "语文": 70,
    "数学": 65,
    "英语": 66,
    "生物": 69,
    "政治": 78,
    "跳远": [1.2, 1.3, 1.2]
}
###################################################

import copy
北凡.update(语文=80)
print(f"星瑶的成绩为 ：{北凡}")

百里 = copy.deepcopy(北凡)
百里.update(语文=90,跳远=[1.2, 1.3, 1.5])
print(f"百里的成绩为 ：{百里}")
